    """ Быстрая сортировка, сортировка Хоара (англ. quicksort), часто называемая qsort (по имени
        в стандартной библиотеке языка Си) — алгоритм сортировки, разработанный английским
        информатиком Тони Хоаром во время своей работы в МГУ в 1960 году.

        Один из самых быстрых известных универсальных алгоритмов сортировки массивов: в среднем
        О(n log n) обменов при упорядочении n элементов; из-за наличия ряда недостатков
        на практике обычно используется с некоторыми доработками. """
